In [7]:
import pandas as pd

In [8]:
df1=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':['111','222','333','444'],
                 'col3':['aaa','bbb','ccc','ddd']})
df1.head()

   col1 col2 col3
0     1  111  aaa
1     2  222  bbb
2     3  333  ccc
3     4  444  ddd

In [9]:
df1['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [10]:
df1['col2'].nunique()

4

In [22]:
df1['col2'].value_counts()

111    1
333    1
222    1
444    1
Name: col2, dtype: int64

In [32]:
newdf=df1[(df1['col1']==3)&(df1['col2']==333)]

In [33]:
newdf

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [34]:
def times2(x):
    return x*2

In [35]:
df1['col2'].apply(len)

0    3
1    3
2    3
3    3
Name: col2, dtype: int64

In [37]:
df1['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [39]:
df1['col1'].sum()

10

In [44]:
del df1['col1']

In [46]:
df1

  col2 col3
0  111  aaa
1  222  bbb
2  333  ccc
3  444  ddd

In [49]:
df1.columns

Index(['col2', 'col3'], dtype='object')

In [50]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [51]:
df1

  col2 col3
0  111  aaa
1  222  bbb
2  333  ccc
3  444  ddd

In [52]:
df1.sort_values(by='col2')

  col2 col3
0  111  aaa
1  222  bbb
2  333  ccc
3  444  ddd

In [54]:
df1.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [56]:
df1.dropna()

  col2 col3
0  111  aaa
1  222  bbb
2  333  ccc
3  444  ddd

In [57]:
import numpy as np

In [60]:
df2=pd.DataFrame({'col1':[1,2,3,np.nan],
                'col2':[np.nan,222,333,444],
                'col3':['aaa','bbb','ccc','ddd']})
df2.head()

   col1   col2 col3
0   1.0    NaN  aaa
1   2.0  222.0  bbb
2   3.0  333.0  ccc
3   NaN  444.0  ddd

In [62]:
df2.fillna('FILL')

   col1  col2 col3
0     1  FILL  aaa
1     2   222  bbb
2     3   333  ccc
3  FILL   444  ddd

In [65]:
data={'A':['Yes','Yes','Yes','No','No','No'],
     'B':['A','A','B','B','A','A'],
     'C':['x','x','x','y','x','y'],
     'D':[1,2,3,5,4,6]}

df3=pd.DataFrame(data)

In [66]:
df3

     A  B  C  D
0  Yes  A  x  1
1  Yes  A  x  2
2  Yes  B  x  3
3   No  B  y  5
4   No  A  x  4
5   No  A  y  6

         D
A   B
No  A  5.0
    B  5.0
Yes A  1.5
    B  3.0

In [76]:
a=df3.pivot_table(values='D',index=['A','B'],columns='C')
a

C        x    y
A   B
No  A  4.0  6.0
    B  NaN  5.0
Yes A  1.5  NaN
    B  3.0  NaN

In [77]:
a.fillna('-')

C        x  y
A   B
No  A    4  6
    B    -  5
Yes A  1.5  -
    B    3  -